In [12]:
import pymysql

In [16]:
db = pymysql.connect("localhost","root","Shalom_1992","company" )

In [17]:
cursor = db.cursor()

In [21]:
cursor.execute("SELECT VERSION()")

1

In [22]:
data = cursor.fetchone()
print ("Database version : %s " % data)

Database version : 5.7.22-0ubuntu0.17.10.1

In [23]:
import pandas as pd
from sqlalchemy import create_engine

In [40]:
engine = create_engine('mysql://demo:Demo_000@localhost/company')

In [41]:
print(engine.table_names())

['MTN', 'NEXTTEL', 'orange']

In [48]:
print(engine.driver)

mysqldb

In [51]:
print(engine.url)

mysql://demo:Demo_000@localhost/company

In [55]:
engine.url?

In [43]:
df  = pd.read_sql_query('show tables', engine)

In [44]:
df

  Tables_in_company
0               MTN
1           NEXTTEL
2            orange

In [47]:
df1 = pd.read_sql_table('NEXTTEL', engine)
df1

   id    name     surname  salary  age sex
0   1    jean  christophe   25000   28   m
1   2  djeuga        jean  500000   52   m
2   3    paul      chatue  546000   35   f
3   4    nick      corpal   25000   52   m

**1. GRANT ACCESS TO A CERTAIN USER**

**2. IMPORT SQLALCHEMY AND PYMYSQL AND PANDAS**

**3. CREATE AN ENGINE WITHT THE ENGINE URL** (actually the url to the actual table

**4. READ IT WITH PANDAS**

In [56]:
#import the dependancies
import sqlalchemy , pymysql
import pandas as pd

In [58]:
#creation of n engine
from sqlalchemy import create_engine
eng = create_engine(str(engine.url))

In [59]:
df = pd.read_sql_query('show tables' , eng)
df

  Tables_in_company
0               MTN
1           NEXTTEL
2            orange

In [60]:
df1 = pd.read_sql_table('NEXTTEL' , eng)
df1

   id    name     surname  salary  age sex
0   1    jean  christophe   25000   28   m
1   2  djeuga        jean  500000   52   m
2   3    paul      chatue  546000   35   f
3   4    nick      corpal   25000   52   m

In [61]:
df2 = pd.read_sql_table('MTN' , eng)
df2

Empty DataFrame
Columns: [id, name, surname, salary, age, size]
Index: []

In [69]:
df3 = pd.read_sql_query("select * from NEXTTEL where sex = 'm'" , eng)
df3

   id    name     surname  salary  age sex
0   1    jean  christophe   25000   28   m
1   2  djeuga        jean  500000   52   m
2   4    nick      corpal   25000   52   m

In [76]:
df4 = df3[['salary' , 'age']]

In [77]:
df4

   salary  age
0   25000   28
1  500000   52
2   25000   52

In [78]:
df4.to_sql('mini' , eng)

In [3]:
import pandas as pd
import sqlalchemy ,pymysql

In [4]:
from sqlalchemy import create_engine

In [5]:
eng2= create_engine('mysql://demo:Demo_000@localhost/company')

In [6]:
print (eng2.table_names())

['MTN', 'NEXTTEL', 'mini', 'orange']

In [8]:
df = pd.read_sql_query('select * from MTN' , con = eng2)
df

       name   owner  id                text       date
0     mouse    rock  12     b'I do want it' 1998-05-06
1  keyboard   armel  14     b'Just TAKE IT' 1992-12-13
2    screen  energy  16  b'Glory be to God' 2003-12-25
3       usb    paul  19       b"great job'" 2017-05-20
4       RAM     bob  26           b'Oups!!' 2018-06-01

In [9]:
df ['sex'] = pd.Series(list('mmmfm'))

In [10]:
df

       name   owner  id                text       date sex
0     mouse    rock  12     b'I do want it' 1998-05-06   m
1  keyboard   armel  14     b'Just TAKE IT' 1992-12-13   m
2    screen  energy  16  b'Glory be to God' 2003-12-25   m
3       usb    paul  19       b"great job'" 2017-05-20   f
4       RAM     bob  26           b'Oups!!' 2018-06-01   m

In [14]:
df.to_sql('MTN_' , eng2)

In [15]:
path = '/mnt/disque1/Apply/Pycon2018/Pycon_2018_Materials/datasets/gapminder.tsv'

In [16]:
df2 = pd.read_csv(path , sep = '\t')
df2.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [18]:
df2.to_sql('gapminder' , con = eng2)

In [19]:
df2.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [ ]:
#mysql> select country  , min(gdpPercap) from gapminder  group by country;